package ki.oprysko.service;

import ki.oprysko.domain.Contract;

import java.util.List;

/**
 * Сервіс повинен повертати REST API відповіді і мати наступну функціональність:
 * - авторизація користувача
 * - створювати новий контракт (`name`, `surname`, `personal id`, `term` та інші поля (за бажанням))
 * - повертати список всіх контрактів
 * - повертати список контрактів по id користувача
 * Сервіс повинен перелбачати валідацію запитів відповідно наступним правилам і відхиляти запит, якщо:
 * - Запит приходить від користувача, який знаходиться в чорному списку
 * - Кількість запитів / секунду з одної країни перевищує певне значення
 * Сервіс повинен визначати країну користувача і зберігати. За замовчуванням код країни має бути виставлений в - "lv".

 * @author Svyatoslav Oprysko
 */
public interface LoanService {
    Contract apply(Contract contract);

    List<Contract> getAll();

    List<Contract> getByPerson(int personId);
}
